{
  "name": "projects",
  "data": [
    {
      "key": 3,
      "title": "Spinal Geometry Modeling for Metastasis Assessment",
      "image": "https://guo-david.github.io/p3.PNG",
      "description": "Modeled healthy spinal geometry with a bi-directional quantile regression framework (XGBoost) that predicts normative vertebral volume and inter-centroid distances from demographic and biomarker features. Built a population Statistical Shape Model via Generalized Procrustes Analysis to capture vertebral shape variance, then integrated both modules into a Python library and dashboard for clinician-facing assessment of metastasis-related deformities.",
      "framework": "Python",
      "skills": ["XGBoost", "Quantile Regression", "Statistical Shape Modeling"],
      "date_start": "Sep 2025",
      "date_end": "Present",
      "repo": "",
      "paper": ""
    },
    {
      "key": 2,
      "title": "Multi-task Pancreas Cancer Segmentation and Classification with nnUNetV2",
      "image": "https://guo-david.github.io/p2.png",
      "description": "This project implements multi-task learning to add a classifier head to nnUNetv2's Residual Encoder preset. This classifier is used to augment nnUNetv2's existing segmentation, specifically in the context of lesion subtypes in pancreatic cancers.",
      "framework": "Pytorch",
      "skills": ["nnUNetv2", "Multi-task Learning", "Medical Imaging"],
      "date_start": "Dec 2024",
      "date_end": "Feb 2025",
      "repo": "https://github.com/guo-david/pancreas-cancer-segmentation",
      "paper": "https://guo-david.github.io/Multi_task_Pancreas_Cancer_Segmentation_and_Classification_with_nnUNetV2.pdf"
    },
    {
      "key": 1,
      "title": "Augmentation of WM811K Silicon Wafer Map Dataset for Error Pattern Detection Training",
      "image": "https://guo-david.github.io/p1.png",
      "description": "In this on-going project, I am investigating the efficacy of using Wasserstein GANs with Gradient Penalty to generate images to balance  the WM-811K silicon wafer map dataset. Being able to generate synthetic data will aid in training image detection models later on to improve fabrication efficacy. Preliminary results show improvement for problem classes.",
      "framework": "Pytorch",
      "skills": ["Wasserstein GAN", "Gradient Penalty", "Data Augmentation"],
      "date_start": "Oct 2024",
      "date_end": "Dec 2024",
      "repo": "https://github.com/guo-david/wafer-defect-gan",
      "paper": ""
    },
    {
      "key": 0,
      "title": "Music Generation Using Autoencoders and Transformer Mixture Distribution Models",
      "image": "https://guo-david.github.io/p0.png",
      "description": "In this project, we developed a model for music generation using autoencoders and transformer mixture distribution models, implemented in TensorFlow. Building on techniques like variational autoencoders (VAEs) and transformers, our approach processes high-dimensional music data to create coherent compositions. By using a sliding window method and training the model on both diverse and classical music datasets, we aimed to capture melodic patterns effectively. While the model performs well at learning tonality, there are still challenges with rhythm and long-term structure. We're continuing to explore ways to enhance the model’s rhythmic coherence and overall musicality.",
      "framework": "Tensorflow",
      "skills": ["Autoencoders", "Transformers", "VAEs", "Music Modeling"],
      "date_start": "Jan 2024",
      "date_end": "May 2024",
      "repo": "https://github.com/guo-david/vae-tmdn-music",
      "paper": "https://guo-david.github.io/Music_Generation_Using_Autoencoders_and_Transformer_Mixture_Distribution_Models.pdf"
    }
  ]
}
